app/Controllers/Dashboard.php

SELECT `kuliner`.`id`, `kuliner`.`nama`, AVG(reviews.rating) AS avg_rating, COUNT(reviews.id) AS review_count
FROM `reviews`
JOIN `kuliner` ON `kuliner`.`id` = `reviews`.`kuliner_id`
WHERE `kuliner`.`status` = 'active'
GROUP BY `kuliner`.`id`
ORDER BY `avg_rating` DESC, `review_count` DESC
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `kuliner`
SELECT COUNT(*) AS `numrows`
FROM `kuliner`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `kuliner`
WHERE `status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `reviews`
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function admin()
    {
        $kulinerModel = new KulinerModel();
        $reviewModel = new ReviewModel();
        $userModel = new UserModel();

        $topRatedKuliner = $reviewModel
            ->select('kuliner.id, kuliner.nama, AVG(reviews.rating) AS avg_rating, COUNT(reviews.id) AS review_count')
            ->join('kuliner', 'kuliner.id = reviews.kuliner_id')
            ->where('kuliner.status', 'active')
            ->groupBy('kuliner.id')
            ->orderBy('avg_rating', 'DESC')
            ->orderBy('review_count', 'DESC')
            ->first();

        $data = [
            'title'            => 'Dashboard Admin',
            'totalKuliner'     => $kulinerModel->countAllResults(),
            'pendingKuliner'   => $kulinerModel->where('status', 'pending')->countAllResults(),
            'activeKuliner'    => $kulinerModel->where('status', 'active')->countAllResults(),
            'reviewCount'      => $reviewModel->countAllResults(),
            'userCount'        => $userModel->countAllResults(),