app/Controllers/Kuliner.php

    private function buildKulinerMetaQuery()
    {
        $builder = $this->kulinerModel->builder();

        return $builder
            ->select('kuliner.*, kategori.nama as kategori_nama, GROUP_CONCAT(DISTINCT tag.nama ORDER BY tag.nama SEPARATOR ", ") as tag_list')
            ->join('kategori', 'kategori.id = kuliner.id_kategori', 'left')
            ->join('kuliner_tag', 'kuliner_tag.kuliner_id = kuliner.id', 'left')
            ->join('tag', 'tag.id = kuliner_tag.tag_id', 'left')
            ->groupBy('kuliner.id');
---
SELECT `kuliner`.*, `kategori`.`nama` as `kategori_nama`, GROUP_CONCAT(DISTINCT tag.nama ORDER BY tag.nama SEPARATOR ", ") as tag_list
FROM `kuliner`
LEFT JOIN `kategori` ON `kategori`.`id` = `kuliner`.`id_kategori`
LEFT JOIN `kuliner_tag` ON `kuliner_tag`.`kuliner_id` = `kuliner`.`id`
LEFT JOIN `tag` ON `tag`.`id` = `kuliner_tag`.`tag_id`
GROUP BY `kuliner`.`id`

    public function update($id)
    {
        $aturan = [
            'nama'        => 'required|min_length[3]',
            'id_kategori' => 'required',
            'gambar'      => 'max_size[gambar,2048]|is_image[gambar]|mime_in[gambar,image/jpg,image/jpeg,image/png]',
            'foto2'       => 'max_size[foto2,2048]|is_image[foto2]|mime_in[foto2,image/jpg,image/jpeg,image/png]',
            'foto3'       => 'max_size[foto3,2048]|is_image[foto3]|mime_in[foto3,image/jpg,image/jpeg,image/png]',
        ];

        if (!$this->validate($aturan)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $kulinerLama = $this->kulinerModel->find($id);
---
SELECT *
FROM `kuliner`
WHERE `kuliner`.`id` = '6'

            $namaFoto3 = $kulinerLama['foto3'];
        }

        $this->kulinerModel->update($id, [
            'id_kategori' => $this->request->getPost('id_kategori'),
            'nama'        => $this->request->getPost('nama'),
            'alamat'      => $this->request->getPost('alamat'),
            'deskripsi'   => $this->request->getPost('deskripsi'),
            'gambar'      => $namaGambar,
            'foto2'       => $namaFoto2,
            'foto3'       => $namaFoto3,
            'lat'         => $this->request->getPost('lat'),
            'lng'         => $this->request->getPost('lng'),
        ]);

        // Update Tags
        $this->kulinerTagModel->where('kuliner_id', $id)->delete();
---
UPDATE `kuliner` SET `id_kategori` = '3', `nama` = 'Burjo Asih 2', `alamat` = 'Udinus Semarang', `deskripsi` = 'Burjo dengan ayam bali ter enak', `gambar` = '1782050077_f29a3a44f0dae880837a.png', `foto2` = NULL, `foto3` = NULL, `lat` = '-6.9824972', `lng` = '110.4098055', `updated_at` = '2026-06-28 15:20:43'
WHERE `kuliner`.`id` IN ('6')
DELETE FROM `kuliner_tag`
WHERE `kuliner_id` = '6'