app/Controllers/Kuliner.php

SELECT *
FROM `kuliner`
---
    public function index()
    {
        $data = [
            'title'   => 'Data Kuliner',
            'kuliner' => $this->kulinerModel->findAll()

INSERT INTO `kuliner` (`user_id`, `nama`, `alamat`, `deskripsi`, `gambar`, `status`, `created_at`, `updated_at`) VALUES (1, 'ayam', 'solo', 'enak', '1779380393_48ab22cc7a1112124e3b.png', 'pending', '2026-05-21 16:19:53', '2026-05-21 16:19:53')
---
    public function store()
    {
        // 1. VALIDASI
        $aturan = [
            'nama'   => 'required|min_length[3]',
            'gambar' => 'uploaded[gambar]|max_size[gambar,2048]|is_image[gambar]|mime_in[gambar,image/jpg,image/jpeg,image/png]'
        ];

        if (!$this->validate($aturan)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // 2. UPLOAD FILE
        $fileGambar = $this->request->getFile('gambar');
        $namaGambar = $fileGambar->getRandomName();
        $uploadPath = FCPATH . 'uploads/kuliner';

        if (!is_dir($uploadPath)) {
            mkdir($uploadPath, 0755, true);
        }

        $fileGambar->move($uploadPath, $namaGambar);

        // 3. SIMPAN KE DATABASE
        $this->kulinerModel->save([
            'user_id'     => 1,
            'nama'        => $this->request->getPost('nama'),
            'alamat'      => $this->request->getPost('alamat'),
            'deskripsi'   => $this->request->getPost('deskripsi'),
            'gambar'      => $namaGambar,
            'status'      => 'pending'
        ]);